// pages/main/News/News.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    NewList:[
      {tab:1,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'},
      {tab:1,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'},
      {tab:1,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'},
      {tab:1,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'},
      {tab:1,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'},
      {tab:0,time:'05-12 14:00',det:'您的服务单已成功接单！由[杭州屹球制冷设备有限公司的工程师为您服务。'}
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})